
<div>
	<h1>TestWork</h1>
	<h2>Vacancy: PHP Developer Yii2</h2>
	<pre id="first">
        Task №1

        Регулярные выражения

        Вводная:

        Есть произвольные числа с 2 знаками после запятой. Пример массива:

        55.10, 55.01, 50.01, 55.00, 50.00

        Задача:

        С использованием функции preg_replace убрать все "лишние" нули после точки. Пример:

        55.10 -> 55.1
        55.01 -> 55.01
        50.01 -> 50.01
        50.00 -> 50
        55.00 -> 55
	</pre>
	<pre id="second">
        Task №2

        Задача на знание и понимание Yii/Yii2
        Вводная:

        Нужно написать простенькое приложение для управления древовидным меню (пусть будет дерево категорий)


        Нужно:

        - использовать basic template приложения
        - использовать composer
        - пункт меню состоит из ссылки и названия
        - должна быть возможность добавить дочерний пункт меню к любому из существующих
        - удалить пункт, при удалении должны быть удалены все дочерние
        - отредактировать пункт
        - модель вид и контролер на yii2
        - вывод меню в древовидном виде
        - дерево должно отрисовываться в PHP скрипте с использованием (html, css), без использования javascript плагинов отрисовывающих дерево самостоятельно типо jqtree
        - для создания формы добавления/редактирования данных нужно использовать ActiveForm
        - Добавление/редактирование данных через модель, с использованием механизмов валидации Yii2

        Не нужно:
        - авторизация
        - дизайн

        Дополнительно:
        Все это на уии с использованием MVC предоставляемого фреймворком.
	</pre>
</div>